In [114]:
import pandas as pd
import numpy as np
columns = []

In [115]:
student_registration = pd.read_csv("data/studentRegistration.csv")

In [116]:
student_registration.head(5)

,code_module,code_presentation,id_student,date_registration,date_unregistration
0,AAA,2013J,11391,-159.0,NaN
1,AAA,2013J,28400,-53.0,NaN
2,AAA,2013J,30268,-92.0,12.0
3,AAA,2013J,31604,-52.0,NaN
4,AAA,2013J,32885,-176.0,NaN

In [117]:
studentRegistration = student_registration[(student_registration.code_module == 'AAA') & (student_registration.code_presentation == '2013J')]
studentIdColumn = 'id_student'
studentId = studentRegistration[[studentIdColumn]]
columns = [studentIdColumn]
studentId.head(5)

   id_student
0       11391
1       28400
2       30268
3       31604
4       32885

In [118]:
studentId.count()

id_student    383
dtype: int64

In [119]:
assesments = pd.read_csv("data/assessments.csv")
assesments = assesments[(assesments.code_module == 'AAA') & (assesments.code_presentation == '2013J')]
assesmentIdColumn = 'id_assessment'
assesmentIds = assesments[assesmentIdColumn]
assesmentIds

0    1752
1    1753
2    1754
3    1755
4    1756
5    1757
Name: id_assessment, dtype: int64

In [120]:
for i in range(len(assesmentIds)): 
    columns.append(assesmentIds[i])

In [121]:
data = np.array(columns)
pd.DataFrame(columns = data)

Empty DataFrame
Columns: [id_student, 1752, 1753, 1754, 1755, 1756, 1757]
Index: []